ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f280013x_pie_ctrl_regs.xml
	<register id="PIEIER8" width="16" page="1" offset="0x10" internal="0" description="Interrupt Group 8 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 8.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 8.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 8.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 8.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 8.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 8.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 8.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 8.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR8" width="16" page="1" offset="0x11" internal="0" description="Interrupt Group 8 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 8.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 8.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 8.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 8.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 8.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 8.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 8.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 8.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER9" width="16" page="1" offset="0x12" internal="0" description="Interrupt Group 9 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 9.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 9.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 9.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 9.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 9.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 9.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 9.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 9.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR9" width="16" page="1" offset="0x13" internal="0" description="Interrupt Group 9 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 9.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 9.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 9.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 9.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 9.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 9.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 9.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 9.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER10" width="16" page="1" offset="0x14" internal="0" description="Interrupt Group 10 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 10.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 10.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 10.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 10.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 10.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 10.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 10.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 10.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR10" width="16" page="1" offset="0x15" internal="0" description="Interrupt Group 10 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 10.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 10.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 10.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 10.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 10.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 10.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 10.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 10.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER11" width="16" page="1" offset="0x16" internal="0" description="Interrupt Group 11 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 11.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 11.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 11.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 11.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 11.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 11.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 11.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 11.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR11" width="16" page="1" offset="0x17" internal="0" description="Interrupt Group 11 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 11.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 11.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 11.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 11.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 11.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 11.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 11.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 11.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER12" width="16" page="1" offset="0x18" internal="0" description="Interrupt Group 12 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 12.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 12.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 12.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 12.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 12.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 12.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 12.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 12.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR12" width="16" page="1" offset="0x19" internal="0" description="Interrupt Group 12 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 12.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 12.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 12.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 12.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 12.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 12.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 12.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 12.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
</module>
